import React from "react";
import AdminCards from "../UI/Cards/AdminCards";
import FeedbacksTable from "../components/tables/FeedbacksTable";
import { useSelector } from "react-redux";
import { Error, Loading } from "../components";

const AllFeedbacks = () => {
  const { data, error, loading } = useSelector((state) => state.global);

  // const currentFeedbacks = [
  //   {
  //     id: 1,
  //     name: "مصطفي كامل أحمد",
  //     comment:
  //       "هذا تصميم لتطبيق جوال لبيع النباتات ، يمكنك أن تجد كل ما تريده من أنواع مختلفة من النباتات والاختيار من بينها ، ثم يمكنك شحنها إلى أي مكان تريده هذا تصميم لتطبيق جوال لبيع النباتات ، يمكنك أن تجد كل ما تريده من أنواع مختلفة من النباتات والاختيار من بينها ، ثم يمكنك شحنها إلى أي مكان تريده..",
  //     date: "22 ديسمبر",
  //     status: "pennding",
  //   },
  //   {
  //     id: 2,
  //     name: "مصطفي كامل أحمد",
  //     comment:
  //       "هذا تصميم لتطبيق جوال لبيع النباتات ، يمكنك أن تجد كل ما تريده من أنواع مختلفة من النباتات والاختيار من بينها ، ثم يمكنك شحنها إلى أي مكان تريده هذا تصميم لتطبيق جوال لبيع النباتات ، يمكنك أن تجد كل ما تريده من أنواع مختلفة من النباتات والاختيار من بينها ، ثم يمكنك شحنها إلى أي مكان تريده..",
  //     date: "22 ديسمبر",
  //     status: "canceled",
  //   },
  //   {
  //     id: 3,
  //     name: "مصطفي كامل أحمد",
  //     comment:
  //       "هذا تصميم لتطبيق جوال لبيع النباتات ، يمكنك أن تجد كل ما تريده من أنواع مختلفة من النباتات والاختيار من بينها ، ثم يمكنك شحنها إلى أي مكان تريده هذا تصميم لتطبيق جوال لبيع النباتات ، يمكنك أن تجد كل ما تريده من أنواع مختلفة من النباتات والاختيار من بينها ، ثم يمكنك شحنها إلى أي مكان تريده..",
  //     date: "22 ديسمبر",
  //     status: "pennding",
  //   },
  //   {
  //     id: 4,
  //     name: "مصطفي كامل أحمد",
  //     comment:
  //       "هذا تصميم لتطبيق جوال لبيع النباتات ، يمكنك أن تجد كل ما تريده من أنواع مختلفة من النباتات والاختيار من بينها ، ثم يمكنك شحنها إلى أي مكان تريده هذا تصميم لتطبيق جوال لبيع النباتات ، يمكنك أن تجد كل ما تريده من أنواع مختلفة من النباتات والاختيار من بينها ، ثم يمكنك شحنها إلى أي مكان تريده..",
  //     date: "22 ديسمبر",
  //     status: "approved",
  //   },
  //   {
  //     id: 5,
  //     name: "مصطفي كامل أحمد",
  //     comment:
  //       "هذا تصميم لتطبيق جوال لبيع النباتات ، يمكنك أن تجد كل ما تريده من أنواع مختلفة من النباتات والاختيار من بينها ، ثم يمكنك شحنها إلى أي مكان تريده هذا تصميم لتطبيق جوال لبيع النباتات ، يمكنك أن تجد كل ما تريده من أنواع مختلفة من النباتات والاختيار من بينها ، ثم يمكنك شحنها إلى أي مكان تريده..",
  //     date: "22 ديسمبر",
  //     status: "approved",
  //   },
  //   {
  //     id: 6,
  //     name: "مصطفي كامل أحمد",
  //     comment:
  //       "هذا تصميم لتطبيق جوال لبيع النباتات ، يمكنك أن تجد كل ما تريده من أنواع مختلفة من النباتات والاختيار من بينها ، ثم يمكنك شحنها إلى أي مكان تريده هذا تصميم لتطبيق جوال لبيع النباتات ، يمكنك أن تجد كل ما تريده من أنواع مختلفة من النباتات والاختيار من بينها ، ثم يمكنك شحنها إلى أي مكان تريده..",
  //     date: "22 ديسمبر",
  //     status: "pennding",
  //   },
  //   {
  //     id: 7,
  //     name: "مصطفي كامل أحمد",
  //     comment:
  //       "هذا تصميم لتطبيق جوال لبيع النباتات ، يمكنك أن تجد كل ما تريده من أنواع مختلفة من النباتات والاختيار من بينها ، ثم يمكنك شحنها إلى أي مكان تريده هذا تصميم لتطبيق جوال لبيع النباتات ، يمكنك أن تجد كل ما تريده من أنواع مختلفة من النباتات والاختيار من بينها ، ثم يمكنك شحنها إلى أي مكان تريده..",
  //     date: "22 ديسمبر",
  //     status: "canceled",
  //   },
  // ];

  // const [feedbacks, setFeedbacks] = useState([]);

  // useEffect(() => {
  //   setFeedbacks(currentFeedbacks);
  //   // eslint-disable-next-line react-hooks/exhaustive-deps
  // }, []);

  if (error) return <Error />;
  if (loading) return <Loading />;

  return (
    <AdminCards>
      <FeedbacksTable currentData={data?.Feedbacks || []} />
    </AdminCards>
  );
};

export default AllFeedbacks;
